In [4]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({
    'name': ['Ram Sharma', 'Hari Mahato', 'Alex Pradhan', 'Bob Marley', 'Cris Brown'],
    'email': ['ram@gmail.com', 'hari@outlook.com', 'alex@gmail.com',
              'bob@yahoo.com', 'cris.123@outlook.com']
})
df

           name                 email
0    Ram Sharma         ram@gmail.com
1   Hari Mahato      hari@outlook.com
2  Alex Pradhan        alex@gmail.com
3    Bob Marley         bob@yahoo.com
4    Cris Brown  cris.123@outlook.com

- to access string from DF, we have `.str` accessor

### Case Conversion

In [6]:
df.name.str.lower()

0      ram sharma
1     hari mahato
2    alex pradhan
3      bob marley
4      cris brown
Name: name, dtype: object

In [7]:
df.name.str.upper()

0      RAM SHARMA
1     HARI MAHATO
2    ALEX PRADHAN
3      BOB MARLEY
4      CRIS BROWN
Name: name, dtype: object

In [8]:
df.name.str.title()

0      Ram Sharma
1     Hari Mahato
2    Alex Pradhan
3      Bob Marley
4      Cris Brown
Name: name, dtype: object

In [9]:
df.name.str.capitalize()

0      Ram sharma
1     Hari mahato
2    Alex pradhan
3      Bob marley
4      Cris brown
Name: name, dtype: object

In [10]:
df[df.name.str.len() == 10]

         name                 email
0  Ram Sharma         ram@gmail.com
3  Bob Marley         bob@yahoo.com
4  Cris Brown  cris.123@outlook.com

In [11]:
# Repeatation of Substring
df['count_a'] = df.name.str.count('a')
df['count_m'] = df.name.str.count('m')
df

           name                 email  count_a  count_m
0    Ram Sharma         ram@gmail.com        3        2
1   Hari Mahato      hari@outlook.com        3        0
2  Alex Pradhan        alex@gmail.com        2        0
3    Bob Marley         bob@yahoo.com        1        0
4    Cris Brown  cris.123@outlook.com        0        0

In [12]:
titanic = pd.read_csv('titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [13]:
titanic['Last_Name'] = titanic.Name.str.split(',').str.get(0)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

In [14]:
titanic.Name.str.split(',').str.get(1).str.strip().str.split(' ', n=1)

0                                 [Mr., Owen Harris]
1      [Mrs., John Bradley (Florence Briggs Thayer)]
2                                     [Miss., Laina]
3              [Mrs., Jacques Heath (Lily May Peel)]
4                               [Mr., William Henry]
                           ...
886                                   [Rev., Juozas]
887                          [Miss., Margaret Edith]
888                [Miss., Catherine Helen "Carrie"]
889                               [Mr., Karl Howell]
890                                   [Mr., Patrick]
Name: Name, Length: 891, dtype: object

In [15]:
titanic[['Title', 'First_Name']]=titanic.Name.str.split(',').str.get(1)\
.str.strip().str.split(' ', n=1, expand=True)

In [16]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name,Title,First_Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr.,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs.,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss.,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs.,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr.,William Henry

# replace string

In [17]:
titanic.Title.value_counts()

Title
Mr.          517
Miss.        182
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Col.           2
Mlle.          2
Major.         2
Ms.            1
Mme.           1
Don.           1
Lady.          1
Sir.           1
Capt.          1
the            1
Jonkheer.      1
Name: count, dtype: int64

In [18]:
titanic.Title = titanic.Title.str.replace('Ms.', 'Miss.')

# Finding Things

In [19]:
titanic.Last_Name[titanic.Last_Name.str.startswith('A')].head()

4              Allen
13         Andersson
25           Asplund
40             Ahlin
49    Arnold-Franchi
Name: Last_Name, dtype: object

In [20]:
titanic.Last_Name[titanic.Last_Name.str.endswith('a')].head()

50       Panula
113     Jussila
164      Panula
173      Sivola
207    Albimona
Name: Last_Name, dtype: object

In [21]:
# find() : return lowest index point
# -1 defines there is no substring
titanic.Last_Name.str.find('a', start=3, end=5)   # start=3, end=5

0     -1
1     -1
2     -1
3     -1
4     -1
      ..
886   -1
887    4
888   -1
889   -1
890   -1
Name: Last_Name, Length: 891, dtype: int64

In [22]:
# slice(start, stop, step) : create substring by range
titanic.First_Name.str.slice(2, 15, 2)

0        e ars
1      h rde F
2           ia
3      cusHah(
4       limHny
        ...
886         oa
887     rae dt
888    teieHln
889      r oel
890        tik
Name: First_Name, Length: 891, dtype: object

# Searching

In [23]:
titanic['Mr.' == titanic.Name]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Last_Name, Title, First_Name]
Index: []

In [24]:
# .contains() : helps to findout content with patt


titanic[titanic.Name.str.contains('Mr.', regex=False, case=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name,Title,First_Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr.,Owen Harris
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr.,William Henry
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Moran,Mr.,James
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,McCarthy,Mr.,Timothy J
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,Saundercock,Mr.,William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,Markun,Mr.,Johann
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S,Banfield,Mr.,Frederick James
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,Sutehall,Mr.,Henry Jr
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr,Mr.,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley,Mr.,Patrick

### Q. Find out which Surname are in top 5 on the basis of occurance.

In [25]:
titanic.Last_Name.value_counts().nlargest(10)

Last_Name
Andersson    9
Sage         7
Skoog        6
Panula       6
Carter       6
Goodwin      6
Johnson      6
Rice         5
Fortune      4
Williams     4
Name: count, dtype: int64

In [26]:
titanic.Last_Name.value_counts().idxmax()

'Andersson'

In [27]:
# .idmax() : return index of largest value
titanic.Age.idxmax()

630

In [28]:
titanic.First_Name = titanic.First_Name.str.strip()

In [29]:
titanic[titanic.First_Name.str.len()<10]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name,Title,First_Name
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss.,Laina
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Moran,Mr.,James
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,McCarthy,Mr.,Timothy J
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,Bonnell,Miss.,Elizabeth
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,Rice,Master.,Eugene
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,Laleff,Mr.,Kristo
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,Markun,Mr.,Johann
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,Sutehall,Mr.,Henry Jr
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila,Rev.,Juozas
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley,Mr.,Patrick